wisteria-1c/Конфигурация/ChartsOfAccounts/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfAccounts>
		<Properties>
			<Name>Управленческий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗакрытия</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаДоходовИРасходов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондирующийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СчетаУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Comment>Валютный</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ТипыСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АмортизацияВнеоборотныхАктивов</Name>
					<Comment>02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнеоборотныеАктивы</Name>
					<Comment>01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаСчетов</Name>
					<Comment>Служебный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дебиторы</Name>
					<Comment>62.01, 60.02, 68.02, 71.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредства</Name>
					<Comment>50, 51, 57</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолгосрочныеОбязательства</Name>
					<Comment>67</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
					<Comment>90.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запасы</Name>
					<Comment>10, 41</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Капитал</Name>
					<Comment>80</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КосвенныеЗатраты</Name>
					<Comment>25</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КраткосрочныеФинансовыеВложения</Name>
					<Comment>58</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторы</Name>
					<Comment>60.01, 62.02, 68.01, 70.01, 71.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитыИЗаймы</Name>
					<Comment>66</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезавершенноеПроизводство</Name>
					<Comment>20</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НераспределеннаяПрибыль</Name>
					<Comment>84</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибылиУбытки</Name>
					<Comment>99</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеВнеоборотныеАктивы</Name>
					<Comment>08</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
					<Comment>90.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеКраткосрочныеОбязательства</Name>
					<Comment>98</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОборотныеАктивы</Name>
					<Comment>94, 97</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
					<Comment>91.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
					<Comment>90.07, 90.08</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервныйИДобавочныйКапитал</Name>
					<Comment>82</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СебестоимостьПродаж</Name>
					<Comment>90.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговаяНаценка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/ChartsOfAccounts/Управленческий/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Получить() Тогда
		УстановитьВидимостьОтФОИспользоватьПодсистемуПроизводство();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьОтФОИспользоватьПодсистемуПроизводство()
	
	ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипСчета");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.Использование = Истина;
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыСчетов.НезавершенноеПроизводство);
	СписокЗначений.Добавить(Перечисления.ТипыСчетов.КосвенныеЗатраты);
	
	ЭлементОтбора.ПравоеЗначение = СписокЗначений;
	
КонецПроцедуры

#КонецОбласти
